Revit 2027 API
ParameterTypeId.AnalyticalModelBaseAlignmentMethod Property
 "Base Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelBaseAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelBaseAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelBaseAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelBaseAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace